这个比赛打得真的是心情复杂，
没想到我还能做出高数题来诶，看样子我真的是宝刀未老哈哈哈哈
最简单的reverse，我应该能做出来吧，反调试？？？内存修改？？？ 做不出来-_-
haskell是什么鬼？？？我看，我看，我再看，看了一天语法好不容易把程序看了个七八分懂，结果还是逆不出来，难过
usb流量分析，网上好多教程，但是谁告诉我数据域10个字节是什么鬼
逆向竟然是扫雷，改成无敌模式就过了，后悔没早点做拿个Pwnhub的邀请码

吐槽结束，下面是正经部分，反思一下自己做的不足的地方：
1. 发现自己只知道做题，但是对比赛的规则不够关注，比如刘通就告诉我界面的左上角的第三个珠子点击可以抽奖，抽到某个字符能够得到一个hint，虽然不知道是真是假，还有一道题只能够提交100次flag，这次运气好没有因为这个吃什么亏，但是下次就不知道怎么样了。
2. 发现自己每次都纠结于一道题，这样子是不是效率太低了呢，从比赛的角度来说，未来拿到更高的分数，如果一道题做不出来，那么应该放弃掉去尝试其他的题目，从锻炼自己的角度来说，如果一道题自己毫无思路的话，在哪里苦苦挣扎是不是太浪费时间了呢，因为之后是会有题解的。也许聪明一些，如果真的实在没有思路的题目，就不要浪费时间去死抠了？
